testdata/IN_2023_02/Roundtrip/produkt/risiko/drv/20211130_drv_dynamikhinweis_2023_02b.xml_request_2023_02b.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <tarif:getQuote xmlns:allg="http://www.bipro.net/namespace/allgemein" xmlns:basis="http://www.bipro.net/namespace/basis" xmlns:dol="urn:de:vb:bipro:taa:dol:1.12" xmlns:dt="http://www.bipro.net/namespace/datentypen" xmlns:gevo="http://www.bipro.net/namespace/gevo" xmlns:nachr="http://www.bipro.net/namespace/nachrichten" xmlns:partner="http://www.bipro.net/namespace/partner" xmlns:pm="http://www.bipro.net/namespace/produktmodell" xmlns:pm-leben="http://www.bipro.net/namespace/versicherung/produktmodell/leben" xmlns:tarif="http://www.bipro.net/namespace/versicherung/tarifierung" xmlns:vbl="urn:de:vb:bipro:taa:leben:1.12" xmlns:vs-pm="http://www.bipro.net/namespace/versicherung/produktmodell" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          
      <tarif:Request>
                
        <nachr:BiPROVersion>2.4.6.1.12</nachr:BiPROVersion>
        <nachr:ConsumerID>WS DEV TEAM</nachr:ConsumerID>
                
        <tarif:Tarifierung>
                      
          <gevo:Vermittler>
                            
            <allg:Vermittlernummer>111/222</allg:Vermittlernummer>
                            
            <allg:PartnerID>0</allg:PartnerID>
                            
            <allg:IHKRegistrierungsnummer>0-1234-56789-AB</allg:IHKRegistrierungsnummer>
                        
          </gevo:Vermittler>
                      
          <tarif:Partner xsi:type="partner:CT_Person">
                            
            <partner:Anrede>1</partner:Anrede>
                            
            <partner:PartnerID>1</partner:PartnerID>
                            
            <partner:ZusaetzlichePartnerdaten xsi:type="pm-leben:CT_Risiko">
                                  
              <basis:Erweiterung xsi:type="vbl:CT_RisikoErweiterung">
                                        
                <vbl:Raucherstatus>Raucher</vbl:Raucherstatus>
                                    
              </basis:Erweiterung>
                                  
              <pm-leben:Koerper>
                                        
                <partner:Groesse>180</partner:Groesse>
                                        
                <partner:Gewicht>75</partner:Gewicht>
                                    
              </pm-leben:Koerper>
                              
            </partner:ZusaetzlichePartnerdaten>
                            
            <partner:Geburtsdatum>1992-11-01</partner:Geburtsdatum>
                            
            <partner:Geschlecht>1</partner:Geschlecht>
                            
            <partner:Staatsangehoerigkeit>D</partner:Staatsangehoerigkeit>
                            
            <partner:Berufstaetigkeit>
                                  
              <partner:Beruf>Koch</partner:Beruf>
                              
            </partner:Berufstaetigkeit>
                        
          </tarif:Partner>
                      
          <tarif:Versicherungsnehmer>
                            
            <partner:PartnerID>1</partner:PartnerID>
                        
          </tarif:Versicherungsnehmer>
                      
          <tarif:Verkaufsprodukt>
                            
            <pm:Produkt xsi:type="pm-leben:CT_Produkt">
                                  
              <basis:Erweiterung xsi:type="vbl:CT_ProduktErweiterung">
                                        
                <vbl:Tarifgruppe>Normal</vbl:Tarifgruppe>
                                    
              </basis:Erweiterung>
                                  
              <pm:GewuenschteZahlungsweise>1</pm:GewuenschteZahlungsweise>
                                  
              <pm:Versicherungsdauer>
                                        
                <allg:Beginn>2023-03-01T12:00</allg:Beginn>
                                    
              </pm:Versicherungsdauer>
                                  
              <pm:Paket xsi:type="dol:STE_PaketErweitert">C</pm:Paket>
                                  
              <pm:Kennung>DRV</pm:Kennung>
                                  
              <pm:Elementarprodukt xsi:type="pm-leben:CT_TodesfallAbsicherung">
                                        
                <basis:Erweiterung xsi:type="vbl:CT_TodesfallAbsicherungErweiterung">
                                              
                  <vbl:ArtRisikoabsicherung>Familie</vbl:ArtRisikoabsicherung>
                                          
                </basis:Erweiterung>
                                        
                <pm:Kondition>
                                              
                  <pm:KategorieID xsi:type="dt:STE_KategorieIDBasis">Zuschlag</pm:KategorieID>
                                              
                  <pm:ArtID xsi:type="dt:STE_KonditionBasis">RisikoZuAbschlag</pm:ArtID>
                                              
                  <pm:Wert>500</pm:Wert>
                                              
                  <pm:Werteinheit>10</pm:Werteinheit>
                                              
                  <pm:Bezeichnung>VersichertePerson</pm:Bezeichnung>
                                          
                </pm:Kondition>
                                        
                <pm:Kondition>
                                              
                  <pm:KategorieID xsi:type="dt:STE_KategorieIDBasis">Zuschlag</pm:KategorieID>
                                              
                  <pm:ArtID xsi:type="vbl:STE_KonditionErweitert">Krankheit</pm:ArtID>
                                              
                  <pm:Wert>20</pm:Wert>
                                              
                  <pm:Werteinheit>10</pm:Werteinheit>
                   
                            
                  <pm:Bezeichnung>VersichertePerson</pm:Bezeichnung>
                                          
                </pm:Kondition>
                                        
                <pm:Versicherungsdauer>
                                              
                  <allg:AnzahlJahre>2</allg:AnzahlJahre>
                                              
                  <allg:AnzahlMonate>0</allg:AnzahlMonate>
                                          
                </pm:Versicherungsdauer>
                                        
                <pm:Dynamik>
                                              
                  <pm:ArtID xsi:type="dt:STE_DynamikBasis">01</pm:ArtID>
                                              
                  <pm:Wert>4</pm:Wert>
                                              
                  <pm:KategorieID>Beitrag</pm:KategorieID>
                                          
                </pm:Dynamik>
                                        
                <vs-pm:VersicherungssummeOderLeistung>
                                              
                  <vs-pm:ArtID xsi:type="vbl:STE_VersicherungssummeOderLeistungErweitert">AnfaenglicheTodesfallleistung</vs-pm:ArtID>
                                              
                  <vs-pm:Wert>610000</vs-pm:Wert>
                                              
                  <vs-pm:Werteinheit>20</vs-pm:Werteinheit>
                                              
                  <vs-pm:Waehrung>EUR</vs-pm:Waehrung>
                                              
                  <vs-pm:Auszahlungsweise>6</vs-pm:Auszahlungsweise>
                                          
                </vs-pm:VersicherungssummeOderLeistung>
                                        
                <pm-leben:IstHauptversicherung>true</pm-leben:IstHauptversicherung>
                                        
                <pm-leben:Produktattribut>51</pm-leben:Produktattribut>
                                        
                <pm-leben:VersichertePerson>
                                              
                  <partner:PartnerID>1</partner:PartnerID>
                                          
                </pm-leben:VersichertePerson>
                                    
              </pm:Elementarprodukt>
                                  
              <pm-leben:VorgabeBerechnung>
                                        
                <pm-leben:ArtID xsi:type="dt:STE_VorgabeBerechnungBasis">GarantierteTodesfallleistung</pm-leben:ArtID>
                                        
                <pm-leben:Kontext xsi:type="dt:STE_VorgabeBerechnungKontextBasis">TodesfallAbsicherung</pm-leben:Kontext>
                                    
              </pm-leben:VorgabeBerechnung>
                              
            </pm:Produkt>
                        
          </tarif:Verkaufsprodukt>
                  
        </tarif:Tarifierung>
            
      </tarif:Request>
      
    </tarif:getQuote>
  </soapenv:Body>
</soapenv:Envelope>
